validation-evidence/aims-overhead-v2-20260805/full_pipeline-20260805T095734Z/wrk-8.txt
Running 30s test @ http://10.103.205.176/api/products/
  2 threads and 8 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   145.79ms   99.20ms 567.76ms   71.79%
    Req/Sec    29.79     12.75    70.00     74.83%
  Latency Distribution
     50%  120.07ms
     75%  187.48ms
     90%  282.31ms
     99%  465.89ms
  1762 requests in 30.09s, 83.09MB read
Requests/sec:     58.57
Transfer/sec:      2.76MB

STDERR